yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le88.h
#define USART2_SR_PE             USART2_SR_bit.PE
#define USART2_SR_FE             USART2_SR_bit.FE
#define USART2_SR_NF             USART2_SR_bit.NF
#define USART2_SR_OR             USART2_SR_bit.OR
#define USART2_SR_IDLE           USART2_SR_bit.IDLE
#define USART2_SR_RXNE           USART2_SR_bit.RXNE
#define USART2_SR_TC             USART2_SR_bit.TC
#define USART2_SR_TXE            USART2_SR_bit.TXE

#define USART2_BRR1_USART_DIV4   USART2_BRR1_bit.USART_DIV4
#define USART2_BRR1_USART_DIV5   USART2_BRR1_bit.USART_DIV5
#define USART2_BRR1_USART_DIV6   USART2_BRR1_bit.USART_DIV6
#define USART2_BRR1_USART_DIV7   USART2_BRR1_bit.USART_DIV7
#define USART2_BRR1_USART_DIV8   USART2_BRR1_bit.USART_DIV8
#define USART2_BRR1_USART_DIV9   USART2_BRR1_bit.USART_DIV9
#define USART2_BRR1_USART_DIV10  USART2_BRR1_bit.USART_DIV10
#define USART2_BRR1_USART_DIV11  USART2_BRR1_bit.USART_DIV11

#define USART2_BRR2_USART_DIV0   USART2_BRR2_bit.USART_DIV0
#define USART2_BRR2_USART_DIV1   USART2_BRR2_bit.USART_DIV1
#define USART2_BRR2_USART_DIV2   USART2_BRR2_bit.USART_DIV2
#define USART2_BRR2_USART_DIV3   USART2_BRR2_bit.USART_DIV3
#define USART2_BRR2_USART_DIV12  USART2_BRR2_bit.USART_DIV12
#define USART2_BRR2_USART_DIV13  USART2_BRR2_bit.USART_DIV13
#define USART2_BRR2_USART_DIV14  USART2_BRR2_bit.USART_DIV14
#define USART2_BRR2_USART_DIV15  USART2_BRR2_bit.USART_DIV15

#define USART2_CR1_PIEN          USART2_CR1_bit.PIEN
#define USART2_CR1_PS            USART2_CR1_bit.PS
#define USART2_CR1_PCEN          USART2_CR1_bit.PCEN
#define USART2_CR1_WAKE          USART2_CR1_bit.WAKE
#define USART2_CR1_M             USART2_CR1_bit.M
#define USART2_CR1_USARTD        USART2_CR1_bit.USARTD
#define USART2_CR1_T8            USART2_CR1_bit.T8
#define USART2_CR1_R8            USART2_CR1_bit.R8

#define USART2_CR2_SBK           USART2_CR2_bit.SBK
#define USART2_CR2_RWU           USART2_CR2_bit.RWU
#define USART2_CR2_REN           USART2_CR2_bit.REN
#define USART2_CR2_TEN           USART2_CR2_bit.TEN
#define USART2_CR2_ILIEN         USART2_CR2_bit.ILIEN
#define USART2_CR2_RIEN          USART2_CR2_bit.RIEN
#define USART2_CR2_TCIEN         USART2_CR2_bit.TCIEN
#define USART2_CR2_TIEN          USART2_CR2_bit.TIEN

#define USART2_CR3_LBCL          USART2_CR3_bit.LBCL
#define USART2_CR3_CPHA          USART2_CR3_bit.CPHA
#define USART2_CR3_CPOL          USART2_CR3_bit.CPOL
#define USART2_CR3_CLKEN         USART2_CR3_bit.CLKEN
#define USART2_CR3_STOP          USART2_CR3_bit.STOP

#define USART2_CR4_ADD           USART2_CR4_bit.ADD

#define USART2_CR5_EIE           USART2_CR5_bit.EIE
#define USART2_CR5_IREN          USART2_CR5_bit.IREN
#define USART2_CR5_IRLP          USART2_CR5_bit.IRLP
#define USART2_CR5_HDSEL         USART2_CR5_bit.HDSEL
#define USART2_CR5_NACK          USART2_CR5_bit.NACK
#define USART2_CR5_SCEN          USART2_CR5_bit.SCEN
#define USART2_CR5_DMAR          USART2_CR5_bit.DMAR
#define USART2_CR5_DMAT          USART2_CR5_bit.DMAT

#endif

/*-------------------------------------------------------------------------
 *      USART2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART2_SR_PE        0x01
#define MASK_USART2_SR_FE        0x02
#define MASK_USART2_SR_NF        0x04
#define MASK_USART2_SR_OR        0x08
#define MASK_USART2_SR_IDLE      0x10
#define MASK_USART2_SR_RXNE      0x20
#define MASK_USART2_SR_TC        0x40
#define MASK_USART2_SR_TXE       0x80

#define MASK_USART2_BRR1_USART_DIV4 0x01
#define MASK_USART2_BRR1_USART_DIV5 0x02
#define MASK_USART2_BRR1_USART_DIV6 0x04
#define MASK_USART2_BRR1_USART_DIV7 0x08
#define MASK_USART2_BRR1_USART_DIV8 0x10
#define MASK_USART2_BRR1_USART_DIV9 0x20
#define MASK_USART2_BRR1_USART_DIV10 0x40
#define MASK_USART2_BRR1_USART_DIV11 0x80

#define MASK_USART2_BRR2_USART_DIV0 0x01
#define MASK_USART2_BRR2_USART_DIV1 0x02
#define MASK_USART2_BRR2_USART_DIV2 0x04
#define MASK_USART2_BRR2_USART_DIV3 0x08
#define MASK_USART2_BRR2_USART_DIV12 0x10
#define MASK_USART2_BRR2_USART_DIV13 0x20
#define MASK_USART2_BRR2_USART_DIV14 0x40
#define MASK_USART2_BRR2_USART_DIV15 0x80

#define MASK_USART2_CR1_PIEN     0x01
#define MASK_USART2_CR1_PS       0x02
#define MASK_USART2_CR1_PCEN     0x04
#define MASK_USART2_CR1_WAKE     0x08
#define MASK_USART2_CR1_M        0x10
#define MASK_USART2_CR1_USARTD   0x20
#define MASK_USART2_CR1_T8       0x40
#define MASK_USART2_CR1_R8       0x80

#define MASK_USART2_CR2_SBK      0x01
#define MASK_USART2_CR2_RWU      0x02
#define MASK_USART2_CR2_REN      0x04
#define MASK_USART2_CR2_TEN      0x08
#define MASK_USART2_CR2_ILIEN    0x10
#define MASK_USART2_CR2_RIEN     0x20
#define MASK_USART2_CR2_TCIEN    0x40
#define MASK_USART2_CR2_TIEN     0x80

#define MASK_USART2_CR3_LBCL     0x01
#define MASK_USART2_CR3_CPHA     0x02
#define MASK_USART2_CR3_CPOL     0x04
#define MASK_USART2_CR3_CLKEN    0x08
#define MASK_USART2_CR3_STOP     0x30

#define MASK_USART2_CR4_ADD      0x0F

#define MASK_USART2_CR5_EIE      0x01
#define MASK_USART2_CR5_IREN     0x02
#define MASK_USART2_CR5_IRLP     0x04
#define MASK_USART2_CR5_HDSEL    0x08
#define MASK_USART2_CR5_NACK     0x10
#define MASK_USART2_CR5_SCEN     0x20
#define MASK_USART2_CR5_DMAR     0x40
#define MASK_USART2_CR5_DMAT     0x80


/*-------------------------------------------------------------------------
 *      USART3 register definitions
 *-----------------------------------------------------------------------*/
/* USART3 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PE          : 1;
  unsigned char FE          : 1;
  unsigned char NF          : 1;
  unsigned char OR          : 1;
  unsigned char IDLE        : 1;
  unsigned char RXNE        : 1;
  unsigned char TC          : 1;
  unsigned char TXE         : 1;
} __BITS_USART3_SR;
#endif
__IO_REG8_BIT(USART3_SR,   0x53F0, __READ, __BITS_USART3_SR);

/* USART3 data register */
__IO_REG8    (USART3_DR,   0x53F1, __READ_WRITE);
/* USART3 baud rate register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV4  : 1;
  unsigned char USART_DIV5  : 1;
  unsigned char USART_DIV6  : 1;
  unsigned char USART_DIV7  : 1;
  unsigned char USART_DIV8  : 1;
  unsigned char USART_DIV9  : 1;
  unsigned char USART_DIV10 : 1;
  unsigned char USART_DIV11 : 1;
} __BITS_USART3_BRR1;
#endif
__IO_REG8_BIT(USART3_BRR1, 0x53F2, __READ_WRITE, __BITS_USART3_BRR1);

