yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le88.h
/* USART3 baud rate register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char USART_DIV0  : 1;
  unsigned char USART_DIV1  : 1;
  unsigned char USART_DIV2  : 1;
  unsigned char USART_DIV3  : 1;
  unsigned char USART_DIV12 : 1;
  unsigned char USART_DIV13 : 1;
  unsigned char USART_DIV14 : 1;
  unsigned char USART_DIV15 : 1;
} __BITS_USART3_BRR2;
#endif
__IO_REG8_BIT(USART3_BRR2, 0x53F3, __READ_WRITE, __BITS_USART3_BRR2);

/* USART3 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PIEN        : 1;
  unsigned char PS          : 1;
  unsigned char PCEN        : 1;
  unsigned char WAKE        : 1;
  unsigned char M           : 1;
  unsigned char USARTD      : 1;
  unsigned char T8          : 1;
  unsigned char R8          : 1;
} __BITS_USART3_CR1;
#endif
__IO_REG8_BIT(USART3_CR1,  0x53F4, __READ_WRITE, __BITS_USART3_CR1);

/* USART3 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_USART3_CR2;
#endif
__IO_REG8_BIT(USART3_CR2,  0x53F5, __READ_WRITE, __BITS_USART3_CR2);

/* USART3 control register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBCL        : 1;
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char CLKEN       : 1;
  unsigned char STOP        : 2;
} __BITS_USART3_CR3;
#endif
__IO_REG8_BIT(USART3_CR3,  0x53F6, __READ_WRITE, __BITS_USART3_CR3);

/* USART3 control register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
} __BITS_USART3_CR4;
#endif
__IO_REG8_BIT(USART3_CR4,  0x53F7, __READ_WRITE, __BITS_USART3_CR4);

/* USART3 control register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EIE         : 1;
  unsigned char IREN        : 1;
  unsigned char IRLP        : 1;
  unsigned char HDSEL       : 1;
  unsigned char NACK        : 1;
  unsigned char SCEN        : 1;
  unsigned char DMAR        : 1;
  unsigned char DMAT        : 1;
} __BITS_USART3_CR5;
#endif
__IO_REG8_BIT(USART3_CR5,  0x53F8, __READ_WRITE, __BITS_USART3_CR5);

/* USART3 guard time register */
__IO_REG8    (USART3_GTR,  0x53F9, __READ_WRITE);
/* USART3 prescaler register */
__IO_REG8    (USART3_PSCR, 0x53FA, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      USART3 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define USART3_SR_PE             USART3_SR_bit.PE
#define USART3_SR_FE             USART3_SR_bit.FE
#define USART3_SR_NF             USART3_SR_bit.NF
#define USART3_SR_OR             USART3_SR_bit.OR
#define USART3_SR_IDLE           USART3_SR_bit.IDLE
#define USART3_SR_RXNE           USART3_SR_bit.RXNE
#define USART3_SR_TC             USART3_SR_bit.TC
#define USART3_SR_TXE            USART3_SR_bit.TXE

#define USART3_BRR1_USART_DIV4   USART3_BRR1_bit.USART_DIV4
#define USART3_BRR1_USART_DIV5   USART3_BRR1_bit.USART_DIV5
#define USART3_BRR1_USART_DIV6   USART3_BRR1_bit.USART_DIV6
#define USART3_BRR1_USART_DIV7   USART3_BRR1_bit.USART_DIV7
#define USART3_BRR1_USART_DIV8   USART3_BRR1_bit.USART_DIV8
#define USART3_BRR1_USART_DIV9   USART3_BRR1_bit.USART_DIV9
#define USART3_BRR1_USART_DIV10  USART3_BRR1_bit.USART_DIV10
#define USART3_BRR1_USART_DIV11  USART3_BRR1_bit.USART_DIV11

#define USART3_BRR2_USART_DIV0   USART3_BRR2_bit.USART_DIV0
#define USART3_BRR2_USART_DIV1   USART3_BRR2_bit.USART_DIV1
#define USART3_BRR2_USART_DIV2   USART3_BRR2_bit.USART_DIV2
#define USART3_BRR2_USART_DIV3   USART3_BRR2_bit.USART_DIV3
#define USART3_BRR2_USART_DIV12  USART3_BRR2_bit.USART_DIV12
#define USART3_BRR2_USART_DIV13  USART3_BRR2_bit.USART_DIV13
#define USART3_BRR2_USART_DIV14  USART3_BRR2_bit.USART_DIV14
#define USART3_BRR2_USART_DIV15  USART3_BRR2_bit.USART_DIV15

#define USART3_CR1_PIEN          USART3_CR1_bit.PIEN
#define USART3_CR1_PS            USART3_CR1_bit.PS
#define USART3_CR1_PCEN          USART3_CR1_bit.PCEN
#define USART3_CR1_WAKE          USART3_CR1_bit.WAKE
#define USART3_CR1_M             USART3_CR1_bit.M
#define USART3_CR1_USARTD        USART3_CR1_bit.USARTD
#define USART3_CR1_T8            USART3_CR1_bit.T8
#define USART3_CR1_R8            USART3_CR1_bit.R8

#define USART3_CR2_SBK           USART3_CR2_bit.SBK
#define USART3_CR2_RWU           USART3_CR2_bit.RWU
#define USART3_CR2_REN           USART3_CR2_bit.REN
#define USART3_CR2_TEN           USART3_CR2_bit.TEN
#define USART3_CR2_ILIEN         USART3_CR2_bit.ILIEN
#define USART3_CR2_RIEN          USART3_CR2_bit.RIEN
#define USART3_CR2_TCIEN         USART3_CR2_bit.TCIEN
#define USART3_CR2_TIEN          USART3_CR2_bit.TIEN

#define USART3_CR3_LBCL          USART3_CR3_bit.LBCL
#define USART3_CR3_CPHA          USART3_CR3_bit.CPHA
#define USART3_CR3_CPOL          USART3_CR3_bit.CPOL
#define USART3_CR3_CLKEN         USART3_CR3_bit.CLKEN
#define USART3_CR3_STOP          USART3_CR3_bit.STOP

#define USART3_CR4_ADD           USART3_CR4_bit.ADD

#define USART3_CR5_EIE           USART3_CR5_bit.EIE
#define USART3_CR5_IREN          USART3_CR5_bit.IREN
#define USART3_CR5_IRLP          USART3_CR5_bit.IRLP
#define USART3_CR5_HDSEL         USART3_CR5_bit.HDSEL
#define USART3_CR5_NACK          USART3_CR5_bit.NACK
#define USART3_CR5_SCEN          USART3_CR5_bit.SCEN
#define USART3_CR5_DMAR          USART3_CR5_bit.DMAR
#define USART3_CR5_DMAT          USART3_CR5_bit.DMAT

#endif

/*-------------------------------------------------------------------------
 *      USART3 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART3_SR_PE        0x01
#define MASK_USART3_SR_FE        0x02
#define MASK_USART3_SR_NF        0x04
#define MASK_USART3_SR_OR        0x08
#define MASK_USART3_SR_IDLE      0x10
#define MASK_USART3_SR_RXNE      0x20
#define MASK_USART3_SR_TC        0x40
#define MASK_USART3_SR_TXE       0x80

#define MASK_USART3_BRR1_USART_DIV4 0x01
#define MASK_USART3_BRR1_USART_DIV5 0x02
#define MASK_USART3_BRR1_USART_DIV6 0x04
#define MASK_USART3_BRR1_USART_DIV7 0x08
#define MASK_USART3_BRR1_USART_DIV8 0x10
#define MASK_USART3_BRR1_USART_DIV9 0x20
#define MASK_USART3_BRR1_USART_DIV10 0x40
#define MASK_USART3_BRR1_USART_DIV11 0x80

