yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al3le88.h
#define LCD_RAM18_S228           LCD_RAM18_bit.S228
#define LCD_RAM18_S229           LCD_RAM18_bit.S229
#define LCD_RAM18_S230           LCD_RAM18_bit.S230
#define LCD_RAM18_S231           LCD_RAM18_bit.S231
#define LCD_RAM18_S232           LCD_RAM18_bit.S232
#define LCD_RAM18_S233           LCD_RAM18_bit.S233
#define LCD_RAM18_S234           LCD_RAM18_bit.S234
#define LCD_RAM18_S235           LCD_RAM18_bit.S235

#define LCD_RAM19_S236           LCD_RAM19_bit.S236
#define LCD_RAM19_S237           LCD_RAM19_bit.S237
#define LCD_RAM19_S238           LCD_RAM19_bit.S238
#define LCD_RAM19_S239           LCD_RAM19_bit.S239
#define LCD_RAM19_S240           LCD_RAM19_bit.S240
#define LCD_RAM19_S241           LCD_RAM19_bit.S241
#define LCD_RAM19_S242           LCD_RAM19_bit.S242
#define LCD_RAM19_S243           LCD_RAM19_bit.S243

#define LCD_RAM20_S328           LCD_RAM20_bit.S328
#define LCD_RAM20_S329           LCD_RAM20_bit.S329
#define LCD_RAM20_S330           LCD_RAM20_bit.S330
#define LCD_RAM20_S331           LCD_RAM20_bit.S331
#define LCD_RAM20_S332           LCD_RAM20_bit.S332
#define LCD_RAM20_S333           LCD_RAM20_bit.S333
#define LCD_RAM20_S334           LCD_RAM20_bit.S334
#define LCD_RAM20_S335           LCD_RAM20_bit.S335

#define LCD_RAM21_S336           LCD_RAM21_bit.S336
#define LCD_RAM21_S337           LCD_RAM21_bit.S337
#define LCD_RAM21_S338           LCD_RAM21_bit.S338
#define LCD_RAM21_S339           LCD_RAM21_bit.S339
#define LCD_RAM21_S340           LCD_RAM21_bit.S340
#define LCD_RAM21_S341           LCD_RAM21_bit.S341
#define LCD_RAM21_S342           LCD_RAM21_bit.S342
#define LCD_RAM21_S343           LCD_RAM21_bit.S343

#endif

/*-------------------------------------------------------------------------
 *      LCD bit masks
 *-----------------------------------------------------------------------*/
#define MASK_LCD_CR1_B2          0x01
#define MASK_LCD_CR1_DUTY0       0x02
#define MASK_LCD_CR1_DUTY1       0x04
#define MASK_LCD_CR1_BLINKF0     0x08
#define MASK_LCD_CR1_BLINKF1     0x10
#define MASK_LCD_CR1_BLINKF2     0x20
#define MASK_LCD_CR1_BLINK0      0x40
#define MASK_LCD_CR1_BLINK1      0x80

#define MASK_LCD_CR2_VSEL        0x01
#define MASK_LCD_CR2_CC0         0x02
#define MASK_LCD_CR2_CC1         0x04
#define MASK_LCD_CR2_CC2         0x08
#define MASK_LCD_CR2_HD          0x10
#define MASK_LCD_CR2_PON0        0x20
#define MASK_LCD_CR2_PON1        0x40
#define MASK_LCD_CR2_PON2        0x80

#define MASK_LCD_CR3_DEAD0       0x01
#define MASK_LCD_CR3_DEAD1       0x02
#define MASK_LCD_CR3_DEAD2       0x04
#define MASK_LCD_CR3_SOFC        0x08
#define MASK_LCD_CR3_SOF         0x10
#define MASK_LCD_CR3_SOFIE       0x20
#define MASK_LCD_CR3_LCDEN       0x40

#define MASK_LCD_FRQ_DIV0        0x01
#define MASK_LCD_FRQ_DIV1        0x02
#define MASK_LCD_FRQ_DIV2        0x04
#define MASK_LCD_FRQ_DIV3        0x08
#define MASK_LCD_FRQ_PS0         0x10
#define MASK_LCD_FRQ_PS1         0x20
#define MASK_LCD_FRQ_PS2         0x40
#define MASK_LCD_FRQ_PS3         0x80

#define MASK_LCD_PM0_SEG00       0x01
#define MASK_LCD_PM0_SEG01       0x02
#define MASK_LCD_PM0_SEG02       0x04
#define MASK_LCD_PM0_SEG03       0x08
#define MASK_LCD_PM0_SEG04       0x10
#define MASK_LCD_PM0_SEG05       0x20
#define MASK_LCD_PM0_SEG06       0x40
#define MASK_LCD_PM0_SEG07       0x80

#define MASK_LCD_PM1_SEG08       0x01
#define MASK_LCD_PM1_SEG09       0x02
#define MASK_LCD_PM1_SEG10       0x04
#define MASK_LCD_PM1_SEG11       0x08
#define MASK_LCD_PM1_SEG12       0x10
#define MASK_LCD_PM1_SEG13       0x20
#define MASK_LCD_PM1_SEG14       0x40
#define MASK_LCD_PM1_SEG15       0x80

#define MASK_LCD_PM2_SEG16       0x01
#define MASK_LCD_PM2_SEG17       0x02
#define MASK_LCD_PM2_SEG18       0x04
#define MASK_LCD_PM2_SEG19       0x08
#define MASK_LCD_PM2_SEG20       0x10
#define MASK_LCD_PM2_SEG21       0x20
#define MASK_LCD_PM2_SEG22       0x40
#define MASK_LCD_PM2_SEG23       0x80

#define MASK_LCD_PM3_SEG24       0x01
#define MASK_LCD_PM3_SEG25       0x02
#define MASK_LCD_PM3_SEG26       0x04
#define MASK_LCD_PM3_SEG27       0x08
#define MASK_LCD_PM3_SEG28       0x10
#define MASK_LCD_PM3_SEG29       0x20
#define MASK_LCD_PM3_SEG30       0x40
#define MASK_LCD_PM3_SEG31       0x80

#define MASK_LCD_PM4_SEG32       0x01
#define MASK_LCD_PM4_SEG33       0x02
#define MASK_LCD_PM4_SEG34       0x04
#define MASK_LCD_PM4_SEG35       0x08
#define MASK_LCD_PM4_SEG36       0x10
#define MASK_LCD_PM4_SEG37       0x20
#define MASK_LCD_PM4_SEG38       0x40
#define MASK_LCD_PM4_SEG39       0x80

#define MASK_LCD_PM5_SEG40       0x01
#define MASK_LCD_PM5_SEG41       0x02
#define MASK_LCD_PM5_SEG42       0x04
#define MASK_LCD_PM5_SEG43       0x08

#define MASK_LCD_RAM0_S000       0x01
#define MASK_LCD_RAM0_S001       0x02
#define MASK_LCD_RAM0_S002       0x04
#define MASK_LCD_RAM0_S003       0x08
#define MASK_LCD_RAM0_S004       0x10
#define MASK_LCD_RAM0_S005       0x20
#define MASK_LCD_RAM0_S006       0x40
#define MASK_LCD_RAM0_S007       0x80

#define MASK_LCD_RAM1_S008       0x01
#define MASK_LCD_RAM1_S009       0x02
#define MASK_LCD_RAM1_S010       0x04
#define MASK_LCD_RAM1_S011       0x08
#define MASK_LCD_RAM1_S012       0x10
#define MASK_LCD_RAM1_S013       0x20
#define MASK_LCD_RAM1_S014       0x40
#define MASK_LCD_RAM1_S015       0x80

#define MASK_LCD_RAM2_S016       0x01
#define MASK_LCD_RAM2_S017       0x02
#define MASK_LCD_RAM2_S018       0x04
#define MASK_LCD_RAM2_S019       0x08
#define MASK_LCD_RAM2_S020       0x10
#define MASK_LCD_RAM2_S021       0x20
#define MASK_LCD_RAM2_S022       0x40
#define MASK_LCD_RAM2_S023       0x80

#define MASK_LCD_RAM3_S024       0x01
#define MASK_LCD_RAM3_S025       0x02
#define MASK_LCD_RAM3_S026       0x04
#define MASK_LCD_RAM3_S027       0x08
#define MASK_LCD_RAM3_S100       0x10
#define MASK_LCD_RAM3_S101       0x20
#define MASK_LCD_RAM3_S102       0x40
#define MASK_LCD_RAM3_S103       0x80

